app/controllers/archivos_controller.rb

  def create
	@archivo = Archivo.new(params[:archivo])
	if @archivo.save
---
INSERT INTO "archivos" ("created_at", "nombre_content_type", "updated_at", "nombre_file_name", "nombre_updated_at", "nombre_file_size") VALUES('2010-10-26 22:11:25', 'application/vnd.ms-excel', '2010-10-26 22:11:25', 'cliente.csv', '2010-10-26 22:11:24', 5854)

  def show
	@archivo = Archivo.find(params[:id])
---
SELECT * FROM "archivos" WHERE ("archivos"."id" = 2)

  def index
	@archivos = Archivo.all
---
SELECT * FROM "archivos"

  def destroy
	@archivo = Archivo.find(params[:id])
	@archivo.destroy
---
SELECT * FROM "archivos" WHERE ("archivos"."id" = 3)
DELETE FROM "archivos" WHERE "id" = 3