app/controllers/clientes_controller.rb

SELECT * FROM "clientes"
---
  def index
    @clientes = Cliente.all

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
---
  def show
    @cliente = Cliente.find(params[:id])

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
---
  def edit
    @cliente = Cliente.find(params[:id])

INSERT INTO "clientes" ("created_at", "nombre", "updated_at", "domicilio", "ing_sistem", "numero") VALUES('2010-10-27 15:34:37', 'OMAR ABRAHAM', '2010-10-27 15:34:37', 'RIVADAVIA 5555', '2010-10-27', 7878)
---
  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
UPDATE "clientes" SET "updated_at" = '2010-10-26 20:46:21', "domicilio" = 'ENTRE RIOS 167 DPTO 9', "nombre" = 'JORGE PEREYRA' WHERE "id" = 1
---
  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])